# Напишите функцию, возвращающую наибольшее из четырех чисел

def max4(n1, n2, n3, n4):
    # TODO: your code here
    pass


# Тестируем функцию
print(max2(5, 6, 12, 7))
print(max2(-10, -12, -4, -9))
print(max2(2.5, 2.6, 2.6, 2.4))
print(max2(-2.5, 0, -1.2, -0.4))
print(max2(-2, -2, -2, -2))
