# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here
names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

name_str = ", ".join(names)
print(name_str)
# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
